In [1]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
from scipy import stats
import statsmodels.api as sm
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, confusion_matrix, precision_score, recall_score
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.metrics import accuracy_score

In [3]:
df=pd.read_csv('fraud_detection_dataset.csv')
pd.set_option('display.max_columns', None)
df

,Transaction_ID,Customer_ID,Transaction_Amount,Transaction_Date,Merchant_ID,Merchant_Category,Card_Type,Is_Online,Is_Fraud,Customer_Age,Customer_Gender,Customer_Income,Transaction_City,Device_Type,Is_International
0,T0001,C001,1878.955193,2022-01-01 00:00:00,M001,Entertainment,Credit,0.0,0.0,59.0,Male,NaN,NaN,Mobile,0.0
1,T0002,C002,4754.064389,2022-01-02 00:00:00,NaN,Clothing,Debit,0.0,0.0,66.0,Male,106204.26510,Houston,NaN,1.0
2,T0003,C003,3662.649770,2022-01-03 00:00:00,M003,Electronics,Prepaid,0.0,0.0,NaN,Female,104454.93990,Chicago,Tablet,0.0
3,T0004,C004,2997.305836,2022-01-04 00:00:00,M004,Entertainment,Credit,0.0,0.0,48.0,Male,51910.04732,New York,Tablet,0.0
4,T0005,NaN,788.533016,2022-01-05 00:00:00,M005,NaN,Credit,0.0,0.0,NaN,Female,102891.54740,Phoenix,Tablet,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,T0196,C046,1752.555777,2022-07-15 00:00:00,NaN,Clothing,Debit,1.0,NaN,63.0,Female,115086.35620,Los Angeles,Mobile,0.0
196,T0197,NaN,NaN,2022-07-16 00:00:00,M017,NaN,Credit,0.0,0.0,40.0,NaN,35105.78918,Chicago,Tablet,NaN
197,T0198,C048,NaN,2022-07-17 00:00:00,M018,Entertainment,NaN,0.0,1.0,49.0,Male,63233.48010,Phoenix,Tablet,0.0
198,T0199,NaN,4436.561257,2022-07-18 00:00:00,M019,Clothing,Prepaid,0.0,0.0,34.0,Male,114361.59200,Phoenix,Tablet,0.0
199,T0200,C050,NaN,2022-07-19 00:00:00,M020,Electronics,NaN,0.0,0.0,67.0,Male,61972.73169,New York,Tablet,0.0

The following function will show me the top 5 rows in the dataset

In [4]:
df.head()

,Transaction_ID,Customer_ID,Transaction_Amount,Transaction_Date,Merchant_ID,Merchant_Category,Card_Type,Is_Online,Is_Fraud,Customer_Age,Customer_Gender,Customer_Income,Transaction_City,Device_Type,Is_International
0,T0001,C001,1878.955193,2022-01-01 00:00:00,M001,Entertainment,Credit,0.0,0.0,59.0,Male,NaN,NaN,Mobile,0.0
1,T0002,C002,4754.064389,2022-01-02 00:00:00,NaN,Clothing,Debit,0.0,0.0,66.0,Male,106204.26510,Houston,NaN,1.0
2,T0003,C003,3662.649770,2022-01-03 00:00:00,M003,Electronics,Prepaid,0.0,0.0,NaN,Female,104454.93990,Chicago,Tablet,0.0
3,T0004,C004,2997.305836,2022-01-04 00:00:00,M004,Entertainment,Credit,0.0,0.0,48.0,Male,51910.04732,New York,Tablet,0.0
4,T0005,NaN,788.533016,2022-01-05 00:00:00,M005,NaN,Credit,0.0,0.0,NaN,Female,102891.54740,Phoenix,Tablet,0.0

The following function will show me the last 5 rows in the dataset

## Dataframe Atributes

### Characterisation of the data set:

### Lets now visualize the data types of each column and any missing values

I will now inspect the data types of the columns

In [5]:
print(df.dtypes)

Transaction_ID         object
Customer_ID            object
Transaction_Amount    float64
Transaction_Date       object
Merchant_ID            object
Merchant_Category      object
Card_Type              object
Is_Online             float64
Is_Fraud              float64
Customer_Age          float64
Customer_Gender        object
Customer_Income       float64
Transaction_City       object
Device_Type            object
Is_International      float64
dtype: object

In [6]:
df.dtypes.value_counts()

object     9
float64    6
dtype: int64

Checking the shape of the dataframe

The following function, will display the number of rows (200) and the number of columns (15)

In [8]:
print('Shape of DataFrame (Observations and Rows) = ', df.shape)

Shape of DataFrame (Observations and Rows) =  (200, 15)

Now I will see the column names

In [9]:
df.columns

Index(['Transaction_ID', 'Customer_ID', 'Transaction_Amount',
       'Transaction_Date', 'Merchant_ID', 'Merchant_Category', 'Card_Type',
       'Is_Online', 'Is_Fraud', 'Customer_Age', 'Customer_Gender',
       'Customer_Income', 'Transaction_City', 'Device_Type',
       'Is_International'],
      dtype='object')

In [10]:
values = df.values
values

array([['T0001', 'C001', 1878.955193, ..., nan, 'Mobile', 0.0],
       ['T0002', 'C002', 4754.064389, ..., 'Houston', nan, 1.0],
       ['T0003', 'C003', 3662.64977, ..., 'Chicago', 'Tablet', 0.0],
       ...,
       ['T0198', 'C048', nan, ..., 'Phoenix', 'Tablet', 0.0],
       ['T0199', nan, 4436.561257, ..., 'Phoenix', 'Tablet', 0.0],
       ['T0200', 'C050', nan, ..., 'New York', 'Tablet', 0.0]],
      dtype=object)

### Number of distinct values in each feature

Lets now visualize the number of distinct values in each feature

In [11]:
for col in df.columns:
    print(col, ': Number of Distinct Values: ', len(df[col].unique()))

Transaction_ID : Number of Distinct Values:  200
Customer_ID : Number of Distinct Values:  51
Transaction_Amount : Number of Distinct Values:  163
Transaction_Date : Number of Distinct Values:  200
Merchant_ID : Number of Distinct Values:  31
Merchant_Category : Number of Distinct Values:  6
Card_Type : Number of Distinct Values:  4
Is_Online : Number of Distinct Values:  3
Is_Fraud : Number of Distinct Values:  3
Customer_Age : Number of Distinct Values:  51
Customer_Gender : Number of Distinct Values:  3
Customer_Income : Number of Distinct Values:  181
Transaction_City : Number of Distinct Values:  6
Device_Type : Number of Distinct Values:  4
Is_International : Number of Distinct Values:  3

Print the distinct values in each feature

In [12]:
for col in df:
    print('COLUMN NAME: ', col,':')
    print(df[col].unique())
    print('\n')

COLUMN NAME:  Transaction_ID :
['T0001' 'T0002' 'T0003' 'T0004' 'T0005' 'T0006' 'T0007' 'T0008' 'T0009'
 'T0010' 'T0011' 'T0012' 'T0013' 'T0014' 'T0015' 'T0016' 'T0017' 'T0018'
 'T0019' 'T0020' 'T0021' 'T0022' 'T0023' 'T0024' 'T0025' 'T0026' 'T0027'
 'T0028' 'T0029' 'T0030' 'T0031' 'T0032' 'T0033' 'T0034' 'T0035' 'T0036'
 'T0037' 'T0038' 'T0039' 'T0040' 'T0041' 'T0042' 'T0043' 'T0044' 'T0045'
 'T0046' 'T0047' 'T0048' 'T0049' 'T0050' 'T0051' 'T0052' 'T0053' 'T0054'
 'T0055' 'T0056' 'T0057' 'T0058' 'T0059' 'T0060' 'T0061' 'T0062' 'T0063'
 'T0064' 'T0065' 'T0066' 'T0067' 'T0068' 'T0069' 'T0070' 'T0071' 'T0072'
 'T0073' 'T0074' 'T0075' 'T0076' 'T0077' 'T0078' 'T0079' 'T0080' 'T0081'
 'T0082' 'T0083' 'T0084' 'T0085' 'T0086' 'T0087' 'T0088' 'T0089' 'T0090'
 'T0091' 'T0092' 'T0093' 'T0094' 'T0095' 'T0096' 'T0097' 'T0098' 'T0099'
 'T0100' 'T0101' 'T0102' 'T0103' 'T0104' 'T0105' 'T0106' 'T0107' 'T0108'
 'T0109' 'T0110' 'T0111' 'T0112' 'T0113' 'T0114' 'T0115' 'T0116' 'T0117'
 'T0118' 'T0119' 'T0120' 'T0121' 'T0122' 'T0123' 'T0124' 'T0125' 'T0126'
 'T0127' 'T0128' 'T0129' 'T0130' 'T0131' 'T0132' 'T0133' 'T0134' 'T0135'
 'T0136' 'T0137' 'T0138' 'T0139' 'T0140' 'T0141' 'T0142' 'T0143' 'T0144'
 'T0145' 'T0146' 'T0147' 'T0148' 'T0149' 'T0150' 'T0151' 'T0152' 'T0153'
 'T0154' 'T0155' 'T0156' 'T0157' 'T0158' 'T0159' 'T0160' 'T0161' 'T0162'
 'T0163' 'T0164' 'T0165' 'T0166' 'T0167' 'T0168' 'T0169' 'T0170' 'T0171'
 'T0172' 'T0173' 'T0174' 'T0175' 'T0176' 'T0177' 'T0178' 'T0179' 'T0180'
 'T0181' 'T0182' 'T0183' 'T0184' 'T0185' 'T0186' 'T0187' 'T0188' 'T0189'
 'T0190' 'T0191' 'T0192' 'T0193' 'T0194' 'T0195' 'T0196' 'T0197' 'T0198'
 'T0199' 'T0200']


COLUMN NAME:  Customer_ID :
['C001' 'C002' 'C003' 'C004' nan 'C007' 'C008' 'C009' 'C010' 'C011' 'C012'
 'C013' 'C014' 'C015' 'C016' 'C017' 'C018' 'C019' 'C020' 'C021' 'C022'
 'C023' 'C024' 'C025' 'C026' 'C027' 'C028' 'C029' 'C030' 'C031' 'C032'
 'C033' 'C034' 'C036' 'C038' 'C039' 'C041' 'C042' 'C043' 'C044' 'C045'
 'C048' 'C049' 'C050' 'C006' 'C035' 'C037' 'C046' 'C047' 'C005' 'C040']


COLUMN NAME:  Transaction_Amount :
[1878.955193   4754.064389   3662.64977    2997.305836    788.5330158
  788.4126565   299.8372247            nan 3009.563909   3543.282163
 4849.850162   4163.888778   1069.572162    917.3065864   925.1885042
 1528.168792   2628.534594   2165.405643   1463.23341    3063.145945
  706.0743647  1838.145598   2285.789221   3928.028047   1006.372173
 2576.029848   2966.148699    241.7875595   334.607449   4744.938831
 4828.503845   4043.902767   1530.022708    497.3838489  3424.322802
 2206.360944    618.9707919  2480.932781   4547.508806   1301.312108
 3315.986199   1565.43827    2605.139426   2738.084294    932.4237331
 4848.227293   3877.912789   4698.099718   4475.188479   2993.520894
 4610.152433    451.5775852   987.9544835   235.6841717  1633.398351
 1949.499676   1790.1991     1411.863203   2718.053455   4012.962934
  382.007712   4934.565814   3863.501399   4079.152528   3537.218146
 3647.745769   3858.63903     379.4828122  1798.743985    588.186607
 4316.886095   3120.257653   1661.181144   1561.801785   1632.664777
 3191.411782   4437.191585   2366.352477   3806.317393   2810.773216
 3857.126228   2474.040026   2618.436819   2143.429682    136.8414425
  166.8316366  3185.687952   1578.636346   2547.767749   4538.756705
 1253.968223   2057.810786   3780.200181   1151.702846   1455.85975
  814.4942234  4649.191285   4042.520694   4358.588345    940.9845938
 4463.869402   2701.317787   4039.126374   4481.495587   1596.83734
  559.1591034  1147.396461   2141.267865   4091.893682   4305.04561
 1118.317974    608.128183   1694.699705   4715.119423   1622.782631
 2598.765202   3518.064605   1824.511716   4812.612002   1266.393656
 2491.270044   1511.382766   1431.354067    194.0658673  2518.368326
  266.8789687  4542.246771    733.0254117  4928.395766   1217.855805
 3363.956382   1195.811345   3643.79958    3165.206095   3171.313257
 2683.515674    460.5459526  4178.159453   1610.692524    213.4679564
 2958.555787   3391.046166     92.77326635 1140.213918   3229.412224
  880.0884807  3457.779313   4684.282644    696.2295113  1711.921092
  576.232871   4624.221155   4387.923373   1297.128722   3303.32039
 4087.938779   2780.45205     474.5828114  4503.086105   3169.176272
 1701.758657   1752.555777   4436.561257  ]


COLUMN NAME:  Transaction_Date :
['2022-01-01 00:00:00' '2022-01-02 00:00:00' '2022-01-03 00:00:00'
 '2022-01-04 00:00:00' '2022-01-05 00:00:00' '2022-01-06 00:00:00'
 '2022-01-07 00:00:00' '2022-01-08 00:00:00' '2022-01-09 00:00:00'
 '2022-01-10 00:00:00' '2022-01-11 00:00:00' '2022-01-12 00:00:00'
 '2022-01-13 00:00:00' '2022-01-14 00:00:00' '2022-01-15 00:00:00'
 '2022-01-16 00:00:00' '2022-01-17 00:00:00' '2022-01-18 00:00:00'
 '2022-01-19 00:00:00' '2022-01-20 00:00:00' '2022-01-21 00:00:00'
 '2022-01-22 00:00:00' '2022-01-23 00:00:00' '2022-01-24 00:00:00'
 '2022-01-25 00:00:00' '2022-01-26 00:00:00' '2022-01-27 00:00:00'
 '2022-01-28 00:00:00' '2022-01-29 00:00:00' '2022-01-30 00:00:00'
 '2022-01-31 00:00:00' '2022-02-01 00:00:00' '2022-02-02 00:00:00'
 '2022-02-03 00:00:00' '2022-02-04 00:00:00' '2022-02-05 00:00:00'
 '2022-02-06 00:00:00' '2022-02-07 00:00:00' '2022-02-08 00:00:00'
 '2022-02-09 00:00:00' '2022-02-10 00:00:00' '2022-02-11 00:00:00'
 '2022-02-12 00:00:00' '2022-02-13 00:00:00' '2022-02-14 00:00:00'
 '2022-02-15 00:00:00' '2022-02-16 00:00:00' '2022-02-17 00:00:00'
 '2022-02-18 00:00:00' '2022-02-19 00:00:00' '2022-02-20 00:00:00'
 '2022-02-21 00:00:00' '2022-02-22 00:00:00' '2022-02-23 00:00:00'
 '2022-02-24 00:00:00' '2022-02-25 00:00:00' '2022-02-26 00:00:00'
 '2022-02-27 00:00:00' '2022-02-28 00:00:00' '2022-03-01 00:00:00'
 '2022-03-02 00:00:00' '2022-03-03 00:00:00' '2022-03-04 00:00:00'
 '2022-03-05 00:00:00' '2022-03-06 00:00:00' '2022-03-07 00:00:00'
 '2022-03-08 00:00:00' '2022-03-09 00:00:00' '2022-03-10 00:00:00'
 '2022-03-11 00:00:00' '2022-03-12 00:00:00' '2022-03-13 00:00:00'
 '2022-03-14 00:00:00' '2022-03-15 00:00:00' '2022-03-16 00:00:00'
 '2022-03-17 00:00:00' '2022-03-18 00:00:00' '2022-03-19 00:00:00'
 '2022-03-20 00:00:00' '2022-03-21 00:00:00' '2022-03-22 00:00:00'
 '2022-03-23 00:00:00' '2022-03-24 00:00:00' '2022-03-25 00:00:00'
 '2022-03-26 00:00:00' '2022-03-27 00:00:00' '2022-03-28 00:00:00'
 '2022-03-29 00:00:00' '2022-03-30 00:00:00' '2022-03-31 00:00:00'
 '2022-04-01 00:00:00' '2022-04-02 00:00:00' '2022-04-03 00:00:00'
 '2022-04-04 00:00:00' '2022-04-05 00:00:00' '2022-04-06 00:00:00'
 '2022-04-07 00:00:00' '2022-04-08 00:00:00' '2022-04-09 00:00:00'
 '2022-04-10 00:00:00' '2022-04-11 00:00:00' '2022-04-12 00:00:00'
 '2022-04-13 00:00:00' '2022-04-14 00:00:00' '2022-04-15 00:00:00'
 '2022-04-16 00:00:00' '2022-04-17 00:00:00' '2022-04-18 00:00:00'
 '2022-04-19 00:00:00' '2022-04-20 00:00:00' '2022-04-21 00:00:00'
 '2022-04-22 00:00:00' '2022-04-23 00:00:00' '2022-04-24 00:00:00'
 '2022-04-25 00:00:00' '2022-04-26 00:00:00' '2022-04-27 00:00:00'
 '2022-04-28 00:00:00' '2022-04-29 00:00:00' '2022-04-30 00:00:00'
 '2022-05-01 00:00:00' '2022-05-02 00:00:00' '2022-05-03 00:00:00'
 '2022-05-04 00:00:00' '2022-05-05 00:00:00' '2022-05-06 00:00:00'
 '2022-05-07 00:00:00' '2022-05-08 00:00:00' '2022-05-09 00:00:00'
 '2022-05-10 00:00:00' '2022-05-11 00:00:00' '2022-05-12 00:00:00'
 '2022-05-13 00:00:00' '2022-05-14 00:00:00' '2022-05-15 00:00:00'
 '2022-05-16 00:00:00' '2022-05-17 00:00:00' '2022-05-18 00:00:00'
 '2022-05-19 00:00:00' '2022-05-20 00:00:00' '2022-05-21 00:00:00'
 '2022-05-22 00:00:00' '2022-05-23 00:00:00' '2022-05-24 00:00:00'
 '2022-05-25 00:00:00' '2022-05-26 00:00:00' '2022-05-27 00:00:00'
 '2022-05-28 00:00:00' '2022-05-29 00:00:00' '2022-05-30 00:00:00'
 '2022-05-31 00:00:00' '2022-06-01 00:00:00' '2022-06-02 00:00:00'
 '2022-06-03 00:00:00' '2022-06-04 00:00:00' '2022-06-05 00:00:00'
 '2022-06-06 00:00:00' '2022-06-07 00:00:00' '2022-06-08 00:00:00'
 '2022-06-09 00:00:00' '2022-06-10 00:00:00' '2022-06-11 00:00:00'
 '2022-06-12 00:00:00' '2022-06-13 00:00:00' '2022-06-14 00:00:00'
 '2022-06-15 00:00:00' '2022-06-16 00:00:00' '2022-06-17 00:00:00'
 '2022-06-18 00:00:00' '2022-06-19 00:00:00' '2022-06-20 00:00:00'
 '2022-06-21 00:00:00' '2022-06-22 00:00:00' '2022-06-23 00:00:00'
 '2022-06-24 00:00:00' '2022-06-25 00:00:00' '2022-06-26 00:00:00'
 '2022-06-27 00:00:00' '2022-06-28 00:00:00' '2022-06-29 00:00:00'
 '2022-06-30 00:00:00' '2022-07-01 00:00:00' '2022-07-02 00:00:00'
 '2022-07-03 00:00:00' '2022-07-04 00:00:00' '2022-07-05 00:00:00'
 '2022-07-06 00:00:00' '2022-07-07 00:00:00' '2022-07-08 00:00:00'
 '2022-07-09 00:00:00' '2022-07-10 00:00:00' '2022-07-11 00:00:00'
 '2022-07-12 00:00:00' '2022-07-13 00:00:00' '2022-07-14 00:00:00'
 '2022-07-15 00:00:00' '2022-07-16 00:00:00' '2022-07-17 00:00:00'
 '2022-07-18 00:00:00' '2022-07-19 00:00:00']


COLUMN NAME:  Merchant_ID :
['M001' nan 'M003' 'M004' 'M005' 'M006' 'M008' 'M009' 'M011' 'M012' 'M013'
 'M014' 'M015' 'M016' 'M017' 'M018' 'M019' 'M020' 'M021' 'M022' 'M023'
 'M024' 'M025' 'M026' 'M027' 'M030' 'M002' 'M010' 'M028' 'M029' 'M007']


COLUMN NAME:  Merchant_Category :
['Entertainment' 'Clothing' 'Electronics' nan 'Groceries' 'Travel']


COLUMN NAME:  Card_Type :
['Credit' 'Debit' 'Prepaid' nan]


COLUMN NAME:  Is_Online :
[ 0.  1. nan]


COLUMN NAME:  Is_Fraud :
[ 0. nan  1.]


COLUMN NAME:  Customer_Age :
[59. 66. nan 48. 68. 31. 57. 39. 28. 40. 18. 63. 54. 38. 43. 53. 32. 64.
 26. 27. 69. 58. 52. 55. 19. 24. 35. 44. 51. 60. 61. 41. 42. 23. 50. 46.
 45. 67. 34. 37. 49. 47. 36. 21. 25. 56. 20. 33. 65. 22. 29.]


COLUMN NAME:  Customer_Gender :
['Male' 'Female' nan]


COLUMN NAME:  Customer_Income :
[         nan 106204.2651  104454.9399   51910.04732 102891.5474
  23700.76347  79626.98785  43000.88373  27695.32016  89628.87759
  53987.49638  92476.67715  26535.63408  51529.03378  73949.12924
  99072.31648  51875.25029  82589.13764 108597.7748   81586.31882
  43295.94748  22440.07816  22126.94109  72893.7134  113906.7699
  99878.32358 119793.4111   96718.82889  67987.56203  82750.54632
 107367.7114  118408.3469   62135.70023  93758.23016  43877.71458
  31047.41131  55462.21576  48723.89917  49630.81205  43360.7751
  24209.31896 118772.239    62777.31337  58432.66472  41825.38879
  98634.50144  28941.10023  61758.07758 107911.8308  114473.2022
  81341.13892  36703.39461 119116.8626   43167.17014  84964.6649
  71268.8511   37652.8032   42048.62091  38643.82621  97958.44736
  55012.52592  25784.26766 116910.263   108378.5885  112775.2283
 119490.7823   37389.52492  59624.20189  95823.84757  35389.59063
 101583.3125   42444.05718  42381.76148  73697.44229  79293.99348
  78008.62078  29148.68374 107746.0863   46560.00426  32951.49213
 108874.808   115565.1498  106212.7617  100951.6075   85524.19806
  75085.73706  28698.67599  60845.32131  57268.8517   45975.37838
  92342.01137  69587.57351  28104.62159  42018.32019  88325.87637
  27613.08595 105120.6914   69514.6527   68058.65773  79240.77847
 102468.0966   54780.92079  87801.61526  76573.1964   46702.82702
 107862.9986   99742.60216  85845.18347 105058.1729  106729.4201
  90836.29767 103701.3328   89747.14617  88014.07718  81861.13782
  95271.66396  35860.51053 108087.0759  107184.3528  102581.6751
  32886.98675  53511.88543  94350.82563  36075.9896  101796.7024
 103213.4178   20638.58717  48703.81332  81692.69184 118118.6178
  83181.3527   45980.35811  83400.57031  73998.53797  97984.53952
  30698.06388  96102.79025  74126.65787 116299.2004   54187.2166
  83262.18931 113202.8106   30250.9728  113722.8487   50096.35669
  90817.20886  26735.06015  78217.04602  54588.3057   82091.55178
  24574.20338 107153.6806  117348.8969  116887.7855   94965.18317
  33008.62401  95826.31959  22458.69165  22212.35515  52361.02191
  68864.31904  97040.74178  88329.53766  64590.27064  47362.66663
 119712.45     62618.13022  65138.70243  36362.38212  99480.95487
  89368.22258  42076.96128  28238.10456  88049.93021  85451.12143
  47325.9527  115086.3562   35105.78918  63233.4801  114361.592
  61972.73169]


COLUMN NAME:  Transaction_City :
[nan 'Houston' 'Chicago' 'New York' 'Phoenix' 'Los Angeles']


COLUMN NAME:  Device_Type :
['Mobile' nan 'Tablet' 'Desktop']


COLUMN NAME:  Is_International :
[ 0.  1. nan]

I will now look for duplicate rows

In [13]:
df.count()

Transaction_ID        200
Customer_ID           163
Transaction_Amount    162
Transaction_Date      200
Merchant_ID           160
Merchant_Category     162
Card_Type             162
Is_Online             180
Is_Fraud              180
Customer_Age          180
Customer_Gender       180
Customer_Income       180
Transaction_City      180
Device_Type           180
Is_International      180
dtype: int64

In [14]:
duplicate_rows_df = df[df.duplicated()]
print("number of duplicate rows: ", duplicate_rows_df.shape)

number of duplicate rows:  (0, 15)

In [15]:
df.duplicated().sum()

0

There is no duplicate data

The following function will give me a summary of statistics pertaining to the float columns and calculate the 5 number summary giving me the Mean, Standard Deviation, 1st Quartile: 25%, 3rd Quartile: 75%, Minimum: Smallest Observation in the Sample and Maximum: Largest Observation in the sample.

I will now call the .describe() function to quickly analyse the summary statistics for the numerical features.

In [16]:
df.describe()

,Transaction_Amount,Is_Online,Is_Fraud,Customer_Age,Customer_Income,Is_International
count,162.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,2483.627917,0.461111,0.083333,44.877778,72922.291160,0.111111
std,1460.796088,0.499876,0.277156,15.260002,30005.132560,0.315146
min,92.773266,0.000000,0.000000,18.000000,20638.587170,0.000000
25%,1226.883909,0.000000,0.000000,35.000000,45979.113178,0.000000
50%,2504.819185,0.000000,0.000000,45.000000,77290.908590,0.000000
75%,3844.424019,1.000000,0.000000,57.250000,99546.366692,0.000000
max,4934.565814,1.000000,1.000000,69.000000,119793.411100,1.000000

In [17]:
df.describe(include=object)

,Transaction_ID,Customer_ID,Transaction_Date,Merchant_ID,Merchant_Category,Card_Type,Customer_Gender,Transaction_City,Device_Type
count,200,163,200,160,162,162,180,180,180
unique,200,50,200,30,5,3,2,5,3
top,T0001,C001,2022-01-01 00:00:00,M005,Entertainment,Credit,Male,Houston,Mobile
freq,1,4,1,7,34,69,100,41,66

In [18]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction_Amount,162.0,2483.627917,1460.796088,92.773266,1226.883909,2504.819185,3844.424019,4934.565814
Is_Online,180.0,0.461111,0.499876,0.000000,0.000000,0.000000,1.000000,1.000000
Is_Fraud,180.0,0.083333,0.277156,0.000000,0.000000,0.000000,0.000000,1.000000
Customer_Age,180.0,44.877778,15.260002,18.000000,35.000000,45.000000,57.250000,69.000000
Customer_Income,180.0,72922.291160,30005.132560,20638.587170,45979.113178,77290.908590,99546.366692,119793.411100
Is_International,180.0,0.111111,0.315146,0.000000,0.000000,0.000000,0.000000,1.000000

In [19]:
print('length of data is', len(df))

length of data is 200

In [20]:
numerical_summary = df.describe().transpose()

palette = sns.color_palette("viridis", as_cmap=True)

numerical_summary.style.background_gradient(cmap=palette)